_notes/2022-06-26-upgrade-kernel-ubuntu.html
---
layout: post
title: "Upgrade Linux kernel"
short: "Notes on upgrading Linux kernel in Ubuntu"
category: GNU/Linux
status: WIP
---

<p>
There exist multiple ways to upgrade the kernel within Ubuntu. I will report the ones I have tried and how to fix some common issues.
</p>

<div id="outline-container-org8389c62" class="outline-2">
<h2 id="org8389c62"><span class="section-number-2">1.</span> Updating from Ubuntu kernel PPA directly</h2>
<div class="outline-text-2" id="text-1">
<p>
The method I show here is not necessarily the best. I take no responsibility if you mess up your system. The Ubuntu Kernel team supply various ready to use kernel versions at <a href="https://kernel.ubuntu.com/~kernel-ppa/mainline">https://kernel.ubuntu.com/~kernel-ppa/mainline</a>. Those versions come with a few &ldquo;.deb&rdquo; files, checksums and metadata. These &ldquo;.deb&rdquo; files contain everything you need to add a new kernel version. You can then get the &ldquo;.deb&rdquo; files either through a `browser` or `wget`. These can then be installed with dpkg (yes no apt, remember we have the files locally). Be sure to read up on the version you intend to install and what files you need. In general you need the headers, modules and image deb files. For example, I wanted to install 5.17.1 for amd64. To do this, I called:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">mkdir</span> l517 &amp;&amp; <span style="color: #fabd2f;">cd</span> l517 <span style="color: #928374;"># </span><span style="color: #928374;">Does not really matter what it is called, just remember WHERE you will install the deb files!</span>
wget <span style="color: #b8bb26;">\</span>
https://kernel.ubuntu.com/~kernel-ppa/mainline/v5.17.1/amd64/linux-headers-5.17.1-051701-generic_5.17.1-051701.202203280950_amd64.deb
wget <span style="color: #b8bb26;">\</span>
https://kernel.ubuntu.com/~kernel-ppa/mainline/v5.17.1/amd64/linux-headers-5.17.1-051701_5.17.1-051701.202203280950_all.deb
wget <span style="color: #b8bb26;">\</span>
https://kernel.ubuntu.com/~kernel-ppa/mainline/v5.17.1/amd64/linux-image-unsigned-5.17.1-051701-generic_5.17.1-051701.202203280950_amd64.deb <span style="color: #b8bb26;">\</span>
wget <span style="color: #b8bb26;">\</span>
https://kernel.ubuntu.com/~kernel-ppa/mainline/v5.17.1/amd64/linux-modules-5.17.1-051701-generic_5.17.1-051701.202203280950_amd64.deb
</pre>
</div>

<p>
Then we need to install all of these &ldquo;.deb&rdquo; files. But beware! Sometimes there are breaking changes that can mess up halfway through.
For example when Libc updates, but the new Libc is not yet in your &ldquo;.sources&rdquo; file in Ubuntu. Keep this in mind and make sure that you do not throw all your eggs in one basket, make backups now!
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #928374;"># </span><span style="color: #928374;">Make sure you did not throw other random files in the earlier created directory!</span>
<span style="color: #fabd2f;">sudo</span> dpkg -i *.deb
</pre>
</div>
<p>
Now if everything went alright, new entries are added to your grub config. Verify if there are any errors and if not reboot.
</p>
</div>

<div id="outline-container-org030b6f8" class="outline-3">
<h3 id="org030b6f8"><span class="section-number-3">1.1.</span> Upgrading from 5.12 to 5.17</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I had an issue with upgrading from 5.12 to 5.17, which involved in libc6 becoming the new libc standard and something with libssl3-dev. Both packages were not available in &ldquo;Ubuntu Focal&rdquo;. I know of two ways to resolve the issue.
</p>
</div>
<div id="outline-container-org383bd48" class="outline-4">
<h4 id="org383bd48"><span class="section-number-4">1.1.1.</span> The hacky way</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Fixed by adding sources for a newer Ubuntu such as &ldquo;Jammy&rdquo; (risky&#x2026;), to my &ldquo;/etc/apt/sources.list&rdquo;, which did contain the new packages. Then call:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">sudo</span> apt --fix-broken install
</pre>
</div>
</div>
</div>
<div id="outline-container-orgad35c1c" class="outline-4">
<h4 id="orgad35c1c"><span class="section-number-4">1.1.2.</span> Update Ubuntu&#x2026;</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Just update Ubuntu itself if you can and then upgrade the kernel.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">sudo</span> apt update
<span style="color: #fabd2f;">sudo</span> apt upgrade
<span style="color: #fabd2f;">sudo</span> do-release-upgrade -p
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb63fac6" class="outline-2">
<h2 id="orgb63fac6"><span class="section-number-2">2.</span> Built a custom kernel</h2>
<div class="outline-text-2" id="text-2">
<p>
More customisation possible and possibilities to add more functionality, the PPA builds might miss stuff. For example, <code>perf</code> is not always included.
</p>

<p>
First get the source by either cloning the Linux repo and checking out to the needed version (e.g. <code>git checkout v5.17</code>) or by using wget and getting one version like <code>wget https://cdn.kernel.org/pub/linux/kernel/v5.x/linux-5.17.tar.gz</code>. The wget version uses less disk space.
</p>

<p>
Then get all needed deps. Currently those are: <code>git bison flex fakeroot build-essential libelf-dev bc xz-utils ncurses-dev libssl-dev</code>.
</p>

<p>
Tnen copy your current config to the Linux dir. We do not want to mess up our old config, just upgrade it. Do this with <code>cp  /boot/config-$(uname -r) .config</code>. Then &ldquo;make&rdquo; the config as needed for the new kernel: <code>make menuconfig</code>. Finally make the files with: <code>make deb-pkg</code>. The resulting deb files can be installed and added to your grub with: <code>sudo dpkg -i *.deb</code>.
</p>
</div>

<div id="outline-container-org661fbea" class="outline-3">
<h3 id="org661fbea"><span class="section-number-3">2.1.</span> How to solve canonical-certs.pem</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We are not canonical, therefore we can not sign it with Canonicals pem file. Therefore, disable the signature with <code>./scripts/config --disable SYSTEM_TRUSTED_KEYS &amp;&amp; ./scripts/config --disable SYSTEM_REVOCATION_KEYS</code> and built the kernel again.
</p>
</div>
</div>

<div id="outline-container-org42d28b5" class="outline-3">
<h3 id="org42d28b5"><span class="section-number-3">2.2.</span> How to solve issue with weird symlink in Linux source</h3>
<div class="outline-text-3" id="text-2-2">
<p>
There is an incorrect symlink somewhere in the repo. Clean does not solve it. What does work is removing the link in question.
</p>
</div>
</div>
</div>
